src/Tasks/аДокументооборотЗадача/аДокументооборотЗадача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>аДокументооборотЗадача</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаКБП</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.аДокументооборотТочкиКорпоративныхПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПрохода</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольРезультаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИднИсполнителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполненияПлан</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатТекстовоеСообщение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполненияФакт</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеТекстовогоРезультата</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеТекстаЗадания</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереадресованоДругому</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереадресованоИзЗадачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>TaskRef.аДокументооборотЗадача</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйРезультат</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцессаНаименование</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗафиксированныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>РеквизитПроцесса</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.аДокументооборотДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизита</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВФорме</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВФормеИностранное</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗафиксированныеЗадачиКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ЗадачаИсполнителя</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>TaskRef.аДокументооборотЗадача</types>
      </type>
    </attributes>
  </tabularSections>
  <addressingAttributes>
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

src/InformationRegisters/аДокументооборотСсылкиПроцессов/аДокументооборотСсылкиПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>аДокументооборотСсылкиПроцессов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions>
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БизнесПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>BusinessProcessRef.аДокументооборотКорпоративныйБизнесПроцесс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/pcru_ПараметрыВыданныхЗадач/pcru_ПараметрыВыданныхЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>pcru_ПараметрыВыданныхЗадач</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеДокумента</name>
    <type>
      <types>CatalogRef.аДокументооборотСостояниеДокументов</types>
    </type>
  </resources>
  <resources>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВидБизнесПроцесса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипЗадач</name>
    <type>
      <types>EnumRef.аГруппировкиЗадач</types>
    </type>
  </resources>
  <resources>
    <name>Просрочено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Выполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыполненияПлан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыполненияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПереадресованоДругому</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Переадресант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаПереадресации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстовыйРезультат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.аДокументооборотКорпоративныйДокумент</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БизнесПроцесс</name>
    <type>
      <types>BusinessProcessRef.аДокументооборотКорпоративныйБизнесПроцесс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>TaskRef.аДокументооборотЗадача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/аДокументооборотСостояниеДокументов/аДокументооборотСостояниеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>аДокументооборотСостояниеДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>СостояниеДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.аДокументооборотСостояниеДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>КорпоративныйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DocumentRef.аДокументооборотКорпоративныйДокумент</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/аДокументооборотРезультатыИсполнителейЗадач/аДокументооборотРезультатыИсполнителейЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>аДокументооборотРезультатыИсполнителейЗадач</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗначениеПараметра</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Characteristic.аДокументооборотРезультатыИсполнителейЗадач</types>
    </type>
  </resources>
  <dimensions>
    <name>БизнесПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>BusinessProcessRef.аДокументооборотКорпоративныйБизнесПроцесс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>TaskRef.аДокументооборотЗадача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрРезультата</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>ChartOfCharacteristicTypesRef.аДокументооборотРезультатыИсполнителейЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Pcru_ТекущийИсполнительПоДокументу/Pcru_ТекущийИсполнительПоДокументу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Pcru_ТекущийИсполнительПоДокументу</name>
  <resources>
    <name>ТекущийИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>КорпоративныйДокумент</name>
    <type>
      <types>DocumentRef.аДокументооборотКорпоративныйДокумент</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/аГруппировкиЗадач/аГруппировкиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>аГруппировкиЗадач</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>НовыеЗадачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗадачиВРаботе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВыполненныеЗадачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Переадресовано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НаходятсяВРаботе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОжидаютВыполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Tasks/аДокументооборотЗадача/ObjectModule.bsl
&После("ПриЗаписи")
Процедура Pcru_ПриЗаписи(Отказ)
	#Область pcru_ПараметрыВыданныхЗадач
	Если не ЗначениеЗаполнено(ЭтотОбъект.Исполнитель)  Тогда
		Возврат;
	КонецЕсли; 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	аДокументооборотСсылкиПроцессов.Объект
	|ИЗ
	|	РегистрСведений.аДокументооборотСсылкиПроцессов КАК аДокументооборотСсылкиПроцессов
	|ГДЕ
	|	аДокументооборотСсылкиПроцессов.БизнесПроцесс = &БизнесПроцесс";
	Запрос.УстановитьПараметр("БизнесПроцесс",ЭтотОбъект.БизнесПроцесс );
	Выборка = Запрос.Выполнить().Выбрать();
	СписокОбъектов = Новый  СписокЗначений;
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Объект) Тогда
			СписокОбъектов.Добавить(Выборка.Объект);
		КонецЕсли;
	КонецЦикла;
	Если СписокОбъектов.Количество() =0 Тогда
		Возврат;
	КонецЕсли; 		
	СсылкаНаЗадачу = ЭтотОбъект.Ссылка;
	СсылкаНаПроцесс = ЭтотОбъект.БизнесПроцесс;	
	Попытка
		Запись =  РегистрыСведений.pcru_ПараметрыВыданныхЗадач.СоздатьМенеджерЗаписи();
		Запись.БизнесПроцесс =  СсылкаНаЗадачу.БизнесПроцесс;
		Запись.ВидБизнесПроцесса =  СсылкаНаЗадачу.БизнесПроцесс.ВидПроцесса;
		Запись.Документ = СписокОбъектов[0].Значение;
		Запись.Задача =  СсылкаНаЗадачу.Ссылка;
		Запись.Исполнитель = СсылкаНаЗадачу.Исполнитель;
		Если  СписокОбъектов[0].Значение.КонтрагентыДоговоры.Количество() > 0 Тогда
			Запись.ДоговорКонтрагента =  СписокОбъектов[0].Значение.КонтрагентыДоговоры[0].ДоговорКонтрагента;
			Запись.Контрагент  =  СписокОбъектов[0].Значение.КонтрагентыДоговоры[0].Контрагент;
		КонецЕсли; 
		Если  СписокОбъектов[0].Значение.ОрганизацииПодразделения.Количество() > 0 Тогда
			Запись.Подразделение  = СписокОбъектов[0].Значение.ОрганизацииПодразделения[0].Подразделение;
		КонецЕсли; 
		Запись.Сумма =  СписокОбъектов[0].Значение.СуммаДокумента;
		Запись.Инициатор   =  СсылкаНаЗадачу.Автор;
		Запись.Выполнена = СсылкаНаЗадачу.Выполнена;
		//
		Запрос1 = Новый Запрос;
		Запрос1.Текст = "ВЫБРАТЬ
		|	аДокументооборотСостояниеДокументов.СостояниеДокумента
		|ИЗ
		|	РегистрСведений.аДокументооборотСостояниеДокументов КАК аДокументооборотСостояниеДокументов
		|ГДЕ
		|	аДокументооборотСостояниеДокументов.КорпоративныйДокумент = &КорпоративныйДокумент";
		Запрос1.УстановитьПараметр("КорпоративныйДокумент",СписокОбъектов[0].Значение );
		Выборка1 = Запрос1.Выполнить().Выбрать();
		Пока Выборка1.Следующий() Цикл
			Запись.СостояниеДокумента  =  Выборка1.СостояниеДокумента;
		КонецЦикла;
		Запись.ДатаВыполненияПлан =    СсылкаНаЗадачу.ДатаВыполненияПлан;
		Если СсылкаНаЗадачу.Выполнена Тогда
			ЗапросРез = Новый Запрос;
			ЗапросРез.Текст = "ВЫБРАТЬ
			|	аДокументооборотРезультатыИсполнителейЗадачСрезПоследних.ПараметрРезультата.Наименование as Наименование,
			|	аДокументооборотРезультатыИсполнителейЗадачСрезПоследних.ЗначениеПараметра
			|ИЗ
			|	РегистрСведений.аДокументооборотРезультатыИсполнителейЗадач.СрезПоследних КАК аДокументооборотРезультатыИсполнителейЗадачСрезПоследних
			|ГДЕ
			|	аДокументооборотРезультатыИсполнителейЗадачСрезПоследних.Задача = &Задача";
			ЗапросРез.УстановитьПараметр("Задача",СсылкаНаЗадачу );
			ВыборкаРез = ЗапросРез.Выполнить().Выбрать();
			Пока ВыборкаРез.Следующий() Цикл
				Если ВыборкаРез.Наименование = "Выбор кнопками панели" Тогда
					Запись.Согласовано =   ВыборкаРез.ЗначениеПараметра;
				КонецЕсли;
				Если ВыборкаРез.Наименование = "Текстовое сообщение" Тогда
					Запись.ТекстовыйРезультат =   ВыборкаРез.ЗначениеПараметра;
				КонецЕсли;
			КонецЦикла;
			Запись.ТипЗадач = Перечисления.аГруппировкиЗадач.ВыполненныеЗадачи;
			Запись.ДатаВыполненияФакт   =    СсылкаНаЗадачу.ДатаВыполненияФакт;
		Иначе
			Запись.Согласовано =   "Не выполнена";
			Запись.ТипЗадач = Перечисления.аГруппировкиЗадач.НаходятсяВРаботе;
			Запись.ТекстовыйРезультат =   "Не выполнена";
		КонецЕсли; 
		Запись.Записать(Истина);
	Исключение
	КонецПопытки;
	#КонецОбласти
	
	Если не СсылкаНаЗадачу.Выполнена Тогда
		МЗТИ = РегистрыСведений.Pcru_ТекущийИсполнительПоДокументу.СоздатьМенеджерЗаписи();
		МЗТИ.КорпоративныйДокумент = СписокОбъектов[0].Значение;
		МЗТИ.ТекущийИсполнитель = СсылкаНаЗадачу.Исполнитель;
		МЗТИ.Записать(Истина);
	Иначе 
		НЗ = РегистрыСведений.Pcru_ТекущийИсполнительПоДокументу.СоздатьНаборЗаписей();
		НЗ.Отбор.КорпоративныйДокумент.Установить(СписокОбъектов[0].Значение, Истина);
		НЗ.Прочитать();
		НЗ.Очистить();
		НЗ.Записать(Истина);
	КонецЕсли; 
	
КонецПроцедуры

//		НЗ.Отбор.Документ.Установить(СписокОбъектов[0].Значение, Истина);
//		НЗ.Отбор.БизнесПроцесс.Установить(СсылкаНаПроцесс, Истина);
//Попытка
//	Блокировка = Новый БлокировкаДанных;
//	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.pcru_ПараметрыВыданныхЗадач");
//	ЭлементБлокировки.УстановитьЗначение("Задача", СсылкаНаЗадачу);
//	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
//	Блокировка.Заблокировать();
//Исключение
//КонецПопытки;
//


//НЗ = РегистрыСведений.pcru_ПараметрыВыданныхЗадач.СоздатьНаборЗаписей();
//НЗ.Отбор.Задача.Установить(СсылкаНаЗадачу, Истина);
//НЗ.Прочитать();
//
//Индекс = 0;
//НетЗаписей = Ложь;
//Если НЗ.Количество() = 0 Тогда
//	НетЗаписей = Истина;
//	    Запись = НЗ.Добавить();


//Иначе 
//	Для каждого Запись  Из НЗ Цикл
//		
//		Запись.БизнесПроцесс =  СсылкаНаЗадачу.БизнесПроцесс;
//		
//		Запись.ВидБизнесПроцесса =  СсылкаНаЗадачу.БизнесПроцесс.ВидПроцесса;
//		
//		Запись.Документ = СписокОбъектов[0].Значение;
//		
//		Запись.Задача =  СсылкаНаЗадачу.Ссылка;
//		
//		Запись.Исполнитель = СсылкаНаЗадачу.Исполнитель;
//		
//		Если  СписокОбъектов[0].Значение.КонтрагентыДоговоры.Количество() > 0 Тогда
//			
//			Запись.ДоговорКонтрагента =  СписокОбъектов[0].Значение.КонтрагентыДоговоры[0].ДоговорКонтрагента;
//			
//			Запись.Контрагент  =  СписокОбъектов[0].Значение.КонтрагентыДоговоры[0].Контрагент;
//			
//		КонецЕсли; 
//		
//		Если  СписокОбъектов[0].Значение.ОрганизацииПодразделения.Количество() > 0 Тогда
//			
//			Запись.Подразделение  = СписокОбъектов[0].Значение.ОрганизацииПодразделения[0].Подразделение;
//			
//		КонецЕсли; 
//		
//		Запись.Сумма =  СписокОбъектов[0].Значение.СуммаДокумента;
//		
//		Запись.Инициатор   =  СсылкаНаЗадачу.Автор;
//		
//		Запись.Выполнена = СсылкаНаЗадачу.Выполнена;
//		//
//		Запрос1 = Новый Запрос;
//		Запрос1.Текст = "ВЫБРАТЬ
//		|	аДокументооборотСостояниеДокументов.СостояниеДокумента
//		|ИЗ
//		|	РегистрСведений.аДокументооборотСостояниеДокументов КАК аДокументооборотСостояниеДокументов
//		|ГДЕ
//		|	аДокументооборотСостояниеДокументов.КорпоративныйДокумент = &КорпоративныйДокумент";
//		Запрос1.УстановитьПараметр("КорпоративныйДокумент",СписокОбъектов[0].Значение );
//		Выборка1 = Запрос1.Выполнить().Выбрать();
//		Пока Выборка1.Следующий() Цикл
//			Запись.СостояниеДокумента  =  Выборка1.СостояниеДокумента;
//		КонецЦикла;
//		
//		Запись.ДатаВыполненияПлан =    СсылкаНаЗадачу.ДатаВыполненияПлан;
//		
//		Если СсылкаНаЗадачу.Выполнена Тогда
//			ЗапросРез = Новый Запрос;
//			ЗапросРез.Текст = "ВЫБРАТЬ
//			|	аДокументооборотРезультатыИсполнителейЗадачСрезПоследних.ПараметрРезультата.Наименование as Наименование,
//			|	аДокументооборотРезультатыИсполнителейЗадачСрезПоследних.ЗначениеПараметра
//			|ИЗ
//			|	РегистрСведений.аДокументооборотРезультатыИсполнителейЗадач.СрезПоследних КАК аДокументооборотРезультатыИсполнителейЗадачСрезПоследних
//			|ГДЕ
//			|	аДокументооборотРезультатыИсполнителейЗадачСрезПоследних.Задача = &Задача";
//			ЗапросРез.УстановитьПараметр("Задача",СсылкаНаЗадачу );
//			ВыборкаРез = ЗапросРез.Выполнить().Выбрать();
//			Пока ВыборкаРез.Следующий() Цикл
//				Если ВыборкаРез.Наименование = "Выбор кнопками панели" Тогда
//					Запись.Согласовано =   ВыборкаРез.ЗначениеПараметра;
//				КонецЕсли;
//				//
//				Если ВыборкаРез.Наименование = "Текстовое сообщение" Тогда
//					Запись.ТекстовыйРезультат =   ВыборкаРез.ЗначениеПараметра;
//				КонецЕсли;
//			КонецЦикла;
//			Запись.ТипЗадач = Перечисления.аГруппировкиЗадач.ВыполненныеЗадачи;
//			Запись.ДатаВыполненияФакт   =    СсылкаНаЗадачу.ДатаВыполненияФакт;
//			//
//		Иначе
//			Запись.Согласовано =   "Не выполнена";
//			Запись.ТипЗадач = Перечисления.аГруппировкиЗадач.НаходятсяВРаботе;
//			Запись.ТекстовыйРезультат =   "Не выполнена";
//			//
//		КонецЕсли; 
//	КонецЦикла; 
//КонецЕсли; 
//НЗ.Записать(Истина);



//Попытка
//	Если НетЗаписей Тогда
//		НЗ = РегистрыСведений.pcru_ПараметрыВыданныхЗадач.СоздатьНаборЗаписей();
//		//НЗ.Отбор.Документ.Установить(СписокОбъектов[0].Значение, Истина);
//		//НЗ.Отбор.БизнесПроцесс.Установить(СсылкаНаПроцесс, Истина);
//		НЗ.Отбор.Исполнитель.Установить(СсылкаНаЗадачу.Исполнитель, Истина);
//		НЗ.Прочитать();
//		Нашли_исполнителя = Ложь;
//		Для каждого Запись  Из НЗ Цикл
//			Если Запись.Исполнитель = СсылкаНаЗадачу.Исполнитель Тогда
//				Запись = НЗ.Добавить();
//				Запись.Задача = СсылкаНаЗадачу;
//				Запись.ВидБизнесПроцесса =  СсылкаНаЗадачу.БизнесПроцесс.ВидПроцесса;
//				Запись.БизнесПроцесс =  СсылкаНаЗадачу.БизнесПроцесс;
//				Запись.ТипЗадач = Перечисления.аГруппировкиЗадач.НаходятсяВРаботе;
//				Запись.Документ = СписокОбъектов[0].Значение;
//				Запись.Выполнена =  СсылкаНаЗадачу.Выполнена;
//				Запись.Согласовано = "Не выполнена";
//				Запись.СостояниеДокумента = Справочники.аДокументооборотСостояниеДокументов.НаСогласовании;
//				Запись.ТекстовыйРезультат = "Не выполнена";
//				Запись.ДатаВыполненияПлан = СсылкаНаЗадачу.ДатаВыполненияПлан;
//				Запись.Исполнитель = СсылкаНаЗадачу.Исполнитель;
//				Если  СписокОбъектов[0].Значение.КонтрагентыДоговоры.Количество() > 0 Тогда
//					Запись.ДоговорКонтрагента =  СписокОбъектов[0].Значение.КонтрагентыДоговоры[0].ДоговорКонтрагента;
//					Запись.Контрагент  =  СписокОбъектов[0].Значение.КонтрагентыДоговоры[0].Контрагент;
//				КонецЕсли; 
//				Если  СписокОбъектов[0].Значение.ОрганизацииПодразделения.Количество() > 0 Тогда
//					Запись.Подразделение  = СписокОбъектов[0].Значение.ОрганизацииПодразделения[0].Подразделение;
//				КонецЕсли; 
//				Запись.Сумма =  СписокОбъектов[0].Значение.СуммаДокумента;
//				Запись.Инициатор   =  СсылкаНаЗадачу.Автор;
//				Запись.Выполнена = СсылкаНаЗадачу.Выполнена;	//
//				Запрос1 = Новый Запрос;
//				Запрос1.Текст = "ВЫБРАТЬ
//				|	аДокументооборотСостояниеДокументов.СостояниеДокумента
//				|ИЗ
//				|	РегистрСведений.аДокументооборотСостояниеДокументов КАК аДокументооборотСостояниеДокументов
//				|ГДЕ
//				|	аДокументооборотСостояниеДокументов.КорпоративныйДокумент = &КорпоративныйДокумент";
//				Запрос1.УстановитьПараметр("КорпоративныйДокумент",СписокОбъектов[0].Значение );
//				Выборка1 = Запрос1.Выполнить().Выбрать();
//				Пока Выборка1.Следующий() Цикл
//					Запись.СостояниеДокумента  =  Выборка1.СостояниеДокумента;
//				КонецЦикла;
//				Запись.ДатаВыполненияПлан =    СсылкаНаЗадачу.ДатаВыполненияПлан;
//				Нашли_исполнителя = Истина;
//			КонецЕсли;   	
//		КонецЦикла; 
//		
//		Если не Нашли_исполнителя Тогда
//			Запись = НЗ.Добавить();
//			Запись.Задача = СсылкаНаЗадачу;
//			Запись.ВидБизнесПроцесса =  СсылкаНаЗадачу.БизнесПроцесс.ВидПроцесса;
//			Запись.БизнесПроцесс =  СсылкаНаЗадачу.БизнесПроцесс;
//			Запись.ТипЗадач = Перечисления.аГруппировкиЗадач.НаходятсяВРаботе;
//			Запись.Документ = СписокОбъектов[0].Значение;
//			Запись.Выполнена =  СсылкаНаЗадачу.Выполнена;
//			Запись.Согласовано = "Не выполнена";
//			Запись.СостояниеДокумента = Справочники.аДокументооборотСостояниеДокументов.НаСогласовании;
//			Запись.ТекстовыйРезультат = "Не выполнена";
//			Запись.ДатаВыполненияПлан = СсылкаНаЗадачу.ДатаВыполненияПлан;
//			Запись.Исполнитель = СсылкаНаЗадачу.Исполнитель;
//			Если  СписокОбъектов[0].Значение.КонтрагентыДоговоры.Количество() > 0 Тогда
//				Запись.ДоговорКонтрагента =  СписокОбъектов[0].Значение.КонтрагентыДоговоры[0].ДоговорКонтрагента;
//				Запись.Контрагент  =  СписокОбъектов[0].Значение.КонтрагентыДоговоры[0].Контрагент;
//			КонецЕсли; 
//			Если  СписокОбъектов[0].Значение.ОрганизацииПодразделения.Количество() > 0 Тогда
//				Запись.Подразделение  = СписокОбъектов[0].Значение.ОрганизацииПодразделения[0].Подразделение;
//			КонецЕсли; 
//			Запись.Сумма =  СписокОбъектов[0].Значение.СуммаДокумента;
//			Запись.Инициатор   =  СсылкаНаЗадачу.Автор;
//			Запись.Выполнена = СсылкаНаЗадачу.Выполнена;	//
//			Запрос1 = Новый Запрос;
//			Запрос1.Текст = "ВЫБРАТЬ
//			|	аДокументооборотСостояниеДокументов.СостояниеДокумента
//			|ИЗ
//			|	РегистрСведений.аДокументооборотСостояниеДокументов КАК аДокументооборотСостояниеДокументов
//			|ГДЕ
//			|	аДокументооборотСостояниеДокументов.КорпоративныйДокумент = &КорпоративныйДокумент";
//			Запрос1.УстановитьПараметр("КорпоративныйДокумент",СписокОбъектов[0].Значение );
//			Выборка1 = Запрос1.Выполнить().Выбрать();
//			Пока Выборка1.Следующий() Цикл
//				Запись.СостояниеДокумента  =  Выборка1.СостояниеДокумента;
//			КонецЦикла;
//			Запись.ДатаВыполненияПлан =    СсылкаНаЗадачу.ДатаВыполненияПлан;
//		КонецЕсли; 
//		НЗ.Записать(Истина);
//	КонецЕсли; 	
//Исключение
//КонецПопытки;
//
